# Spark SQL Demo

In [1]:
from pyspark.sql import SparkSession
spark = SparkSession \
    .builder \
    .master("local[*]") \
    .appName('My First Spark application') \
    .getOrCreate() 

sc = spark.sparkContext

Read in some data:

In [2]:
business = spark.read.json('../non_auto_assignments/data/yelp_academic/yelp_academic_dataset_business.json.gz')

In [3]:
checkin = spark.read.json('../non_auto_assignments/data/yelp_academic/yelp_academic_dataset_checkin.json.gz')
review = spark.read.json('../non_auto_assignments/data/yelp_academic/yelp_academic_dataset_review.json.gz')
tip = spark.read.json('../non_auto_assignments/data/yelp_academic/yelp_academic_dataset_tip.json.gz')
user = spark.read.json('../non_auto_assignments/data/yelp_academic/yelp_academic_dataset_user.json.gz')

Look at a schema:

In [4]:
tip.printSchema()

root
 |-- business_id: string (nullable = true)
 |-- compliment_count: long (nullable = true)
 |-- date: string (nullable = true)
 |-- text: string (nullable = true)
 |-- user_id: string (nullable = true)

and some data:

In [5]:
tips = tip.first().asDict()

In [6]:
for k,v in tips.items():
    print(f'{k}:\t{v}')

business_id:	VaKXUpmWTTWDKbpJ3aQdMw
compliment_count:	0
date:	2014-03-27 03:51:24
text:	Great for watching games, ufc, and whatever else tickles yer fancy
user_id:	UPw5DWs_b-e2JRBS-t37Ag

Create a temporary view and issue a SQL query:

In [7]:
tip.createOrReplaceTempView("tip")
result = spark.sql("SELECT COUNT(*) FROM tip")

Show the results:

In [8]:
result.show()

+--------+
|count(1)|
+--------+
| 1223094|
+--------+

Does it match what we would expect?

In [9]:
tip.count()

1223094

Go ahead and create temp views for all our DataFrames:

In [10]:
business.createOrReplaceTempView("business")
checkin.createOrReplaceTempView("checkin")
tip.createOrReplaceTempView("tip")
review.createOrReplaceTempView("review")
user.createOrReplaceTempView("user")

## Simple SQL query

In [11]:
result = spark.sql("SELECT * FROM business WHERE state='QC'")
result.show()

+--------------------+--------------------+--------------------+--------------------+-------------------+--------------------+-------+-------------+--------------+--------------------+-----------+------------+-----+-----+
|             address|          attributes|         business_id|          categories|               city|               hours|is_open|     latitude|     longitude|                name|postal_code|review_count|stars|state|
+--------------------+--------------------+--------------------+--------------------+-------------------+--------------------+-------+-------------+--------------+--------------------+-----------+------------+-----+-----+
|8261 Saint-Lauren...|[,, u'full_bar', ...|i_oghUPqLzzJtxC6Z...|Canadian (New), P...|           Montréal|[11:30-22:0, 11:3...|      1|   45.5397329|    -73.633639|            Braseiro|    H2P 2M1|          22|  4.0|   QC|
|2425 Boulevard Go...|[,,,,,,, True,,, ...|735UkyT4px_oeW3iy...|  Parks, Active Life|           Montréal|[9:0-16:30, 9:0-1...|      1|45.5838977316| -73.653777726|Parc-nature de l'...|    H2B 1X7|          10|  4.5|   QC|
|   10897 Rue du Pont|[,, u'full_bar', ...|SWX0K1dpy4fcRq-kt...|Landmarks & Histo...|           Montréal|[10:0-22:0, 10:0-...|      0|    45.574857|     -73.66113|  Bistro des Moulins|    H2B 2H3|           3|  3.5|   QC|
|134 Rue Jean-Talon O|[,,, {'romantic':...|spi9UEWyNrq2O4y5D...|Vietnamese, Resta...|           Montréal|[17:0-20:0, 11:0-...|      0|   45.5331108|   -73.6195176|    Restaurant Nhu Y|    H2R 2X1|          11|  4.0|   QC|
| 5411 rue Beaubien E|[,,,,,,,,,,, True...|cBQDYO0dIpG6--I3D...|Hair Removal, Bea...|           Montréal|[10:0-21:0,, 10:0...|      1|    45.575935|    -73.568558|    Secrets de Femme|    H1T 1W7|           3|  1.0|   QC|
|580 boulevard Sai...|[,, 'full_bar', {...|v8zKjH1o_qAI4SBd3...|Restaurants, Cana...|              Laval|[11:0-23:0, 11:0-...|      1|45.5751900233|-73.7133273778|            Barbie's|    H7M 3Y2|          13|  3.0|   QC|
|     1452 Rue Cunard|[,,,,,,, False,,,...|jqOwxL3g8ZIagujom...|Barbers, Beauty &...|              Laval|[10:0-20:0, 10:0-...|      1|45.5814235272|-73.7331728194|      Jim le Barbier|    H7S 2B7|           5|  4.5|   QC|
|6950 Rue Saint-Denis|[,,,,,,,,,,,,,,,,...|NqpX1HsFVGwmnxnw_...|Restaurants, Amer...|           Montréal|                null|      0|   45.5370914|   -73.6121815|Aux Derniers Humains|    H2S 2S4|           8|  4.0|   QC|
|7622 Rue Saint-Hu...|[,, u'full_bar', ...|3E0JDI0XMUoFztoEm...|     Nightlife, Bars|           Montréal|[16:0-3:0, 16:0-3...|      1|    45.543774|    -73.620155|           Le Record|    H2R 2N6|           3|  3.5|   QC|
|3435 Boulevard St...|                null|4Rp1y8L_zecjHt6Av...|Cajun/Creole, Res...|           Montréal|                null|      1|   45.5128836|   -73.5699696|             Factory|    H2X 1C2|           3|  2.5|   QC|
|417 Rue Saint-Pie...|[,, u'none', {'ro...|LF66oShCh30k5NOV6...|Coffee & Tea, Caf...|           Montréal|[8:0-18:0, 8:0-18...|      1|   45.5016615|    -73.556605|         Flyjin Café|        H2Y|          17|  4.5|   QC|
|  2 Rue Sherbrooke E|[,, u'beer_and_wi...|9uhXxFrTR58KVD5fq...|Restaurants, Burg...|           Montréal|                null|      0| 45.512532975|-73.5692959126|        Jerry Ferrer|    H2X 1C2|          10|  4.0|   QC|
|5300 rue Sherbroo...|[,,,,,,,,,,,,,,,,...|5GXKxdlJQOrmoPe0G...|Local Flavor, Chi...|           Montréal|[11:30-23:0, 11:3...|      0|   45.5679434|   -73.5526664|         Jardin Tiki|    H1V 1A1|           8|  2.5|   QC|
|220 Boulevard de ...|[,, u'beer_and_wi...|6gorEMxDpiCTUmLXI...|Restaurants, Vege...|              Laval|[11:0-22:0, 11:0-...|      1|    45.576182|    -73.683505|     Tandoori Xpress|    H7G 2E1|           8|  2.5|   QC|
|3878 Boulevard Sa...|[,,,,,,, True,,, ...|eJMbAEvDNyet8_Mma...|Beauty & Spas, Na...|           Montréal|[10:0-19:30,, 10:...|      1|    45.516051|    -73.577805|Ongles Spa St-Lau...|    H2W 1Y2|          16|  4.0|   QC|
|  1801 Rue Ontario E|[,, u'full_bar', ...|CodoVn98WzIP2_NC1...|Restaurants, Cana...|           Montréal|[17:0-22:0,, 17:0...|      1|   45.5260887|   -73.5595135|Chez ma Grosse Tr...|    H2K 1T5|          30|  3.5|   QC|
|3339 Boulevard de...|[,, u'full_bar', ...|4B8VnRAstRRshxiUz...|Restaurants, Sush...|Dollard-des-Ormeaux|[17:0-0:0, 17:0-2...|      1|    45.484315|    -73.795652|   Maiko Sushi - DDO|    H9B 1Z8|          51|  4.0|   QC|
|12585 Sherbrooke ...|[,, u'full_bar', ...|8ELlbjnXfZAw4KbQR...|Italian, Restaurants|Pointe-Aux-Trembles|                null|      1|45.6509944559|-73.5120002206|      Tomate Basilic|    H1B 1C8|           8|  4.0|   QC|
|4101 Rue Sherbroo...|[,,,,,,, True,,, ...|G_05ZI4Vpl4bxjjZR...|Arts & Entertainm...|           Montréal|[9:0-17:0,, 9:0-1...|      1|45.5603345562|-73.5612237261|Jardin Botanique ...|    H1X 2B2|         207|  4.5|   QC|
|4299 rue Ontario Est|[,, u'none', {'ro...|G7sVtpD6aqpuUB4F3...|Breakfast & Brunc...|           Montréal|[6:45-19:0, 7:0-1...|      1|45.5524867983|-73.5399850964|          Hoche Café|    H1V 1K4|          65|  4.0|   QC|
+--------------------+--------------------+--------------------+--------------------+-------------------+--------------------+-------+-------------+--------------+--------------------+-----------+------------+-----+-----+
only showing top 20 rows

We often count things:

In [12]:
result = spark.sql("SELECT count(*) FROM business WHERE state='QC'")
result.show()

+--------+
|count(1)|
+--------+
|    9219|
+--------+

Clean up the column name:

In [13]:
result = spark.sql("SELECT count(*) AS the_count FROM business WHERE state='QC'")
result.show()

+---------+
|the_count|
+---------+
|     9219|
+---------+

Show some grouping (and query formatting):

In [14]:
query = """
SELECT state,count(*) 
    FROM business 
    GROUP BY state
"""
result = spark.sql(query)
result.show()

+-----+--------+
|state|count(1)|
+-----+--------+
|   AZ|   56686|
|   SC|    1162|
|  BAS|       1|
|   NJ|       1|
|   VA|       2|
|   QC|    9219|
|   BC|       1|
|   NV|   36312|
|   WI|    5154|
|   CA|      19|
|   NE|       2|
|   CT|       3|
|   NC|   14720|
|   VT|       2|
|   IL|    1932|
|  XGL|       1|
|   WA|       3|
|   AL|       3|
|  XGM|       4|
|   OH|   14697|
+-----+--------+
only showing top 20 rows

In [15]:
query = """
SELECT state,count(*) as count
    FROM business 
    GROUP BY state
    ORDER BY count(*) DESC
"""
result = spark.sql(query)
result.show()

+-----+-----+
|state|count|
+-----+-----+
|   AZ|56686|
|   NV|36312|
|   ON|33412|
|   NC|14720|
|   OH|14697|
|   PA|11216|
|   QC| 9219|
|   AB| 8012|
|   WI| 5154|
|   IL| 1932|
|   SC| 1162|
|   NY|   22|
|   CA|   19|
|   TX|    6|
|   FL|    4|
|  XGM|    4|
|   WA|    3|
|   AL|    3|
|   CT|    3|
|   NE|    2|
+-----+-----+
only showing top 20 rows

Joining two tables:

In [16]:
query = """
SELECT business.name, tip.text 
    FROM tip 
    LEFT JOIN business 
        ON tip.business_id = business.business_id
"""
result = spark.sql(query)
result.show()

+--------------------+--------------------+
|                name|                text|
+--------------------+--------------------+
|  Buffalo Wild Wings|Great for watchin...|
|      Sonic Drive-In|Happy Hour 2-4 da...|
|Arriba Mexican Grill|Good chips and sa...|
|               Ah-So|The setting and d...|
|            Petagogy|Molly is definate...|
|Yupha's Thai Kitchen|It's true! The dr...|
|      The Black Bull|Only worth a visi...|
|             Fushimi|Hands down best A...|
|           Starbucks|Sat in the drive ...|
|       Brake Masters|Okay so I had a g...|
|Le Montmartre Fre...|More parking in t...|
|       Haus Murphy's|Best pretzels thi...|
|   Krua Thai Cuisine|Having the yellow...|
|  The Captain's Boil|When you receive ...|
|          Burger Bar|2nd stop for the ...|
|            Biên Hòa|Really delicious ...|
| East End Food Co-Op|            Dinner!!|
|   Noodles & Company|Long lines at lun...|
|Findlay Honda Hen...|Go somewhere else...|
|Alberta King of Subs|#poutinecrawl #yy...|
+--------------------+--------------------+
only showing top 20 rows

## Sampling

In [17]:
query = """
SELECT * FROM checkin TABLESAMPLE (1 PERCENT)
"""
result = spark.sql(query)
result.count()

1623

## User-defined functions

In [18]:
def square(x):
    return x*x

In [19]:
from pyspark.sql.functions import udf
from pyspark.sql.types import IntegerType
square_udf_int = udf(lambda z: square(z), IntegerType())

In [20]:
spark.udf.register('square_udf_int',square)

In [21]:
query = """
SELECT square_udf_int(compliment_count) AS compliments_squared 
   FROM tip 
   ORDER BY compliments_squared DESC
"""
result = spark.sql(query)
result.show()

+-------------------+
|compliments_squared|
+-------------------+
|                  9|
|                  9|
|                  9|
|                  9|
|                  9|
|                  9|
|                  9|
|                  9|
|                  9|
|                  9|
|                  9|
|                  9|
|                  9|
|                  9|
|                  9|
|                  9|
|                  9|
|                  9|
|                  9|
|                  9|
+-------------------+
only showing top 20 rows

## Pandas interoperability

In [22]:
query = """
SELECT state,count(*) as count
    FROM business 
    GROUP BY state
    ORDER BY count(*) DESC
"""
result = spark.sql(query)
result.show()

+-----+-----+
|state|count|
+-----+-----+
|   AZ|56686|
|   NV|36312|
|   ON|33412|
|   NC|14720|
|   OH|14697|
|   PA|11216|
|   QC| 9219|
|   AB| 8012|
|   WI| 5154|
|   IL| 1932|
|   SC| 1162|
|   NY|   22|
|   CA|   19|
|   TX|    6|
|  XGM|    4|
|   FL|    4|
|   WA|    3|
|   AL|    3|
|   CT|    3|
|  XWY|    2|
+-----+-----+
only showing top 20 rows

In [23]:
pandas_result = result.toPandas()

In [24]:
pandas_result

   state  count
0     AZ  56686
1     NV  36312
2     ON  33412
3     NC  14720
4     OH  14697
5     PA  11216
6     QC   9219
7     AB   8012
8     WI   5154
9     IL   1932
10    SC   1162
11    NY     22
12    CA     19
13    TX      6
14   XGM      4
15    FL      4
16    CT      3
17    WA      3
18    AL      3
19    VA      2
20    NE      2
21    VT      2
22   XWY      2
23    GA      2
24    AK      2
25   BAS      1
26    NJ      1
27    BC      1
28   XGL      1
29    TN      1
30    NM      1
31   DUR      1
32   DOW      1
33   CON      1
34    AR      1
35    UT      1